check_server_availability_tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung
  SYSTEM '/usr/local/Cellar/tsung/1.5.1/share/tsung/tsung-1.0.dtd'>
<tsung loglevel="notice" version="1.0">
  <!-- Client side setup -->
  <clients>
    <client host="localhost" maxusers="30000000" use_controller_vm="true"/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="app-sender-pre-1.sender.loc" port="80" type="tcp"/>
  </servers>


  <load>

   <arrivalphase phase="1" duration="10" unit="minute">
      <users arrivalrate="1000" unit="second"/>
      </arrivalphase>
  </load>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <!-- full url with server name, this overrides the "server" config value -->
      <request>
        <http method="GET" url="/check_server_availability" version="1.1"/>
      </request>
    </session>
  </sessions>
</tsung>